public class WorkClass {
}
/*
Array.sort(mas,Collections,reverseOrder());
Integer[]
__
int[][]a = {{1,2,3},{4,5,6}};
for(int[]v:a)
    for(int x: v)
    System.out.print(x);
__
x != x.clone()
x.clone.getClass() = x.getClass()
x.equals(x.clone)

Clonable
int[][]b =a.clone;
a==b (false то есть ссылки будут разные)
a[0]==b[0] (true)
если изменить b изменится и а
__
public static тип f(пар-ры)
{...}
переменная = f(арг);

static int sum(int ... nums){
int res=0;
for (int n:nums)
    res+=n;
return res;}
k=sum(1,2,3,4);
k=sum();
__
try{
}
catch(Exceptetion ex){
System.out.printeln(ex.getMessage());
}
finally
{...}
__
Scanner in = new Scanner(System.in);
    next слова до проебал
    nextLine() строчку
    nextInt()
 */
/*
Задачи
1. Дана матрица найти все ее седловые точки
2. Дана матрциа 9*9 проверить удовлетрворят ли она привлу судоку
3. Матрица {
1100011
1001000
0011100
0000100
0000100 найти максимальное месторождение
}
    4.распечатать наибольшую цеопчку слова в которй каждое слово начианеся на ту же буку на
    которые заканичвается предыдущее
5. поменять местами 2 слвоа макимальной и минимальной длины
 */